#+TITLE: Emacs configuration
#+AUTHOR: Attila V. Molnár
#+OPTIONS: toc:4 h:4
#+STARTUP overview

*** Set repositories

#+begin_src emacs-lisp :tangle yes

	(unless (assoc-default "melpa" package-archives)
		(add-to-list 'package-archives '("melpa" . "http://melpa.org/packages/") t))
	;; (unless (assoc-default "org" package-archives)
	;;   (add-to-list 'package-archives '("org" . "http://orgmode.org/elpa/") t))
#+end_src

#+RESULTS:
: ((gnu . http://elpa.gnu.org/packages/) (melpa . http://melpa.org/packages/))

*** Store customization in a separate file

Much better than tainting the =init.el= file.

#+begin_src emacs-lisp :tangle yes

	(setq custom-file "~/.emacs.d/custom-options.el")

#+end_src

#+RESULTS:
: ~/.emacs.d/custom-options.el

*** Recently edited files

#+begin_src emacs-lisp :tangle yes

	(require 'recentf)
	(setq recentf-max-saved-items 300)
	(setq recentf-max-menu-items 20)

#+end_src

#+RESULTS:
: 20


*** Centralized backup and auto-clean backup dir

Make Emacs to write backup and auto-save files in a [[https://www.emacswiki.org/emacs/BackupDirectory][specific directory]] instead of messing up the project file trees.

#+begin_src emacs-lisp :tangle yes
(setq delete-old-versions -1)
(setq version-control t)
(setq vc-make-backup-files nil)

(unless (file-directory-p user-backup-dir)
	(make-directory user-backup-dir))

(unless (file-directory-p user-auto-save-dir)
	(make-directory user-auto-save-dir))

(setq backup-directory-alist
			`((".*" . ,user-backup-dir)))
(setq auto-save-file-name-transforms
			`((".*" ,user-auto-save-dir t)))

#+end_src

#+RESULTS:
| .* | /tmp/ | t |

Delete backup files older then a week

#+begin_src emacs-lisp :tangle yes

  (let ((week (* 60 60 24 7))
        (current (float-time (current-time))))
    (dolist (file (directory-files user-backup-dir t))
      (when (and (backup-file-name-p file)
                 (> (- current (float-time (fifth (file-attributes file))))
                    week))
        (message "%s" file)
        (delete-file file))))

#+end_src

#+RESULTS:

**** Allow recursive dired deletes

#+begin_src emacs-lisp :tangle yes
  (setq dired-recursive-deletes  +1)
#+end_src

#+RESULTS:
: 1

**** Act on multiple files from differen dirs

Source: https://www.masteringemacs.org/article/working-multiple-files-dired

#+begin_src emacs-lisp :tangle yes

	(require 'find-dired)
	(setq find-ls-option '("-print0 | xargs -0 ls -ld" . "-ld"))
	(unbind-key (kbd "s") dired-mode-map)
	(define-key dired-mode-map (kbd "s f") 'find-name-dired)

#+end_src

#+RESULTS:
: (-print0 | xargs -0 ls -ld . -ld)

***** Latex header

#+begin_src emacs-lisp :tangle yes

;; (setq org-global-properties '(("LATEX_HEADER" . "\\usepackage{hyperref} \\usepackage{tcolorbox} \\hypersetup{colorlinks=true, linkcolor=black, urlcolor=blue}")))
;; (add-to-list 'org-global-properties '("latex_header" . "\\usepackage{hyperref} \\usepackage{tcolorbox} \\hypersetup{colorlinks=true, linkcolor=black, urlcolor=blue}"))

(setq org-latex-classes '(("article" "\\documentclass[11pt]{article}
\\usepackage{hyperref}
\\usepackage{tcolorbox}
\\hypersetup{colorlinks=true, linkcolor=black, urlcolor=blue}"

	("\\section{%s}" . "\\section*{%s}")
	("\\subsection{%s}" . "\\subsection*{%s}")
	("\\subsubsection{%s}" . "\\subsubsection*{%s}")
	("\\paragraph{%s}" . "\\paragraph*{%s}")
	("\\subparagraph{%s}" . "\\subparagraph*{%s}"))
 ("report" "\\documentclass[11pt]{report}"
	("\\part{%s}" . "\\part*{%s}")
	("\\chapter{%s}" . "\\chapter*{%s}")
	("\\section{%s}" . "\\section*{%s}")
	("\\subsection{%s}" . "\\subsection*{%s}")
	("\\subsubsection{%s}" . "\\subsubsection*{%s}"))
 ("book" "\\documentclass[11pt]{book}"
	("\\part{%s}" . "\\part*{%s}")
	("\\chapter{%s}" . "\\chapter*{%s}")
	("\\section{%s}" . "\\section*{%s}")
	("\\subsection{%s}" . "\\subsection*{%s}")
	("\\subsubsection{%s}" . "\\subsubsection*{%s}"))))
#+end_src

#+RESULTS:
| article | \documentclass[11pt]{article} |

***** js2 mode

#+begin_src emacs-lisp :tangle yes

	(use-package js2-mode
		:straight t
		:defer t
		:init
		(add-to-list 'auto-mode-alist '("\\.js\\'" . js2-mode))
		:config
		;; indentation basis
		(setq js2-basic-offset 2)
		;; Ignore preprocessor directives for node.js files
		(setq js2-skip-preprocessor-directives t))

#+end_src

#+RESULTS:
: ~/.emacs.d/.eslintrc.yml

**** Shell script mode
#+begin_src emacs-lisp :tangle yes

	(add-to-list 'magic-mode-alist '("^#![/binuserahz]\\{7,11\\}" "#!/bin/bash" . shell-script-mode))
	(add-to-list 'magic-mode-alist '("^#![/binusernv]\\{7,13\\}\\ ?[bashz]\\{2,4\\}" . shell-script-mode))
	(add-to-list 'auto-mode-alist '("\\.?bashrc" . shell-script-mode))
	(add-to-list 'auto-mode-alist '("\\.?zshrc" . shell-script-mode))

	(use-package company-shell
		:straight t
		:defer t
		:init
		(add-hook
		 'shell-mode-hook
		 (lambda ()
			 (setq-local company-backend 'company-shell))))

#+end_src

#+RESULTS:
| lambda | nil | (setq-local company-backend (quote company-shell)) |

***** Fish-shell like autosuggestions

#+begin_src emacs-lisp :tangle yes

		(use-package esh-autosuggest
			:straight t
			:hook (eshell-mode . esh-autosuggest-mode)
			;; If you have use-package-hook-name-suffix set to nil, uncomment and use the
			;; line below instead:
			;; :hook (eshell-mode-hook . esh-autosuggest-mode)
			:ensure t
			:config
			(defun setup-eshell-helm-completion ()
				(define-key eshell-mode-map [remap eshell-pcomplete] 'helm-esh-pcomplete))

			(add-hook 'eshell-mode-hook #'setup-eshell-helm-completion))


#+end_src

#+RESULTS:
| setup-eshell-helm-completion | esh-autosuggest-mode |
***** Eshell eldoc and quick man search support

#+begin_src emacs-lisp :tangle yes

	(use-package esh-help
		:straight t)

	(require 'esh-help)
	(setup-esh-help-eldoc)  ;; To use eldoc in Eshell

	(add-hook 'eshell-mode-hook
						(lambda ()
							(define-key eshell-mode-map (kbd "<insert> h h") 'esh-help-run-help)))

#+end_src

#+RESULTS:
| (lambda nil (define-key eshell-mode-map (kbd <insert> h h) (quote esh-help-run-help))) | #[nil \301\300!\210\302\211\207 [eldoc-documentation-function make-local-variable esh-help-eldoc-command] 2] | (lambda nil (setup-esh-help-eldoc)) | (lambda nil (require (quote eshell-prompt-extras)) (setq eshell-highlight-prompt nil eshell-prompt-function (quote epe-theme-lambda))) | (lambda nil (autoload (quote epe-theme-lambda) eshell-prompt-extras) (setq eshell-highlight-prompt nil eshell-prompt-function (quote epe-theme-lambda))) | eshell-prompt-extras | setup-eshell-helm-completion | esh-autosuggest-mode |

**** Basic python-mode config

#+begin_src emacs-lisp :tangle yes

(require 'python)

(defun attila/run-python ()
	(interactive)
	(if (buffer-live-p (get-buffer "*Python*"))
			(progn
				(kill-buffer "*Python*")
				(call-interactively 'run-python))
		(call-interactively 'run-python)))


(define-key python-mode-map (kbd "<insert> c c") 'attila/run-python)
(define-key python-mode-map (kbd "<insert> c m") 'run-python)
(define-key python-mode-map (kbd "<insert> e b") 'python-shell-send-buffer)
(define-key python-mode-map (kbd "<insert> e f") 'python-shell-send-defun)
(define-key python-mode-map (kbd "<insert> e r") 'python-shell-send-region)
(add-hook 'elpy-mode-hook (lambda ()
														(color-identifiers-mode t)))
#+end_src

#+RESULTS:
| lambda | nil | (color-identifiers-mode t) |

*** ini files

#+begin_src emacs-lisp :tangle yes
(use-package ini-mode
	:straight t
	:mode ("\\.ini\\'"))
#+end_src

#+RESULTS:
: ((\.ini\' . ini-mode) (\.?zshrc . shell-script-mode) (\.?bashrc . shell-script-mode) (\(?:\(?:\(?:\.\(?:b\(?:\(?:abel\|ower\)rc\)\|json\(?:ld\)?\)\|composer\.lock\)\)\'\) . json-mode) (\.js\' . js2-mode) (\.liq\' . web-mode) (\.svg\' . web-mode) (\.css\' . web-mode) (\.html\' . web-mode) (\.djhtml\' . web-mode) (\.mustache\' . web-mode) (\.erb\' . web-mode) (\.as[cp]x\' . web-mode) (\.[agj]sp\' . web-mode) (\.tpl\.php\' . web-mode) (\.phtml\' . web-mode) (\.log\' . logview) (\.bats\' . bats-mode) (\.hva\' . latex-mode) (\.drv\' . latex-mode) (\.[Cc][Ss][Vv]\' . csv-mode) (Dockerfile\' . dockerfile-mode) (/\.editorconfig\' . editorconfig-conf-mode) (\.elm\' . elm-mode) (/fish_funced\..*\' . fish-mode) (\.fish\' . fish-mode) (/etc/gitconfig\' . gitconfig-mode) (/\.gitmodules\' . gitconfig-mode) (/git/config\' . gitconfig-mode) (/modules/.*/config\' . gitconfig-mode) (/\.git/config\' . gitconfig-mode) (/\.gitconfig\' . gitconfig-mode) (\.glsl\' . glsl-mode) (\.geom\' . glsl-mode) (\.frag\' . glsl-mode) (\.vert\' . glsl-mode) (\.graphql\' . graphql-mode) (\.hsc\' . haskell-mode) (\.l[gh]s\' . literate-haskell-mode) (\.[gh]s\' . haskell-mode) (\.cabal\' . haskell-cabal-mode) (\.chs\' . haskell-c2hs-mode) (\.ghci\' . ghci-script-mode) (\.dump-simpl\' . ghc-core-mode) (\.hcr\' . ghc-core-mode) (\(?:build\|profile\)\.boot\' . clojure-mode) (\.cljs\' . clojurescript-mode) (\.cljc\' . clojurec-mode) (\.\(clj\|dtm\|edn\)\' . clojure-mode) (\.pug\' . jade-mode) (\.jade\' . jade-mode) (\.less\' . less-css-mode) (\.log\' . log4j-mode) (/git-rebase-todo\' . git-rebase-mode) (/nginx/.+\.conf\' . nginx-mode) (nginx\.conf\' . nginx-mode) (\.nix.in\' . nix-mode) (\.nix\' . nix-mode) (\.R$ . R-mode) (\.jl\' . julia-mode) (\.tlc$ . tlc-mode) (\.m$ . matlab-mode) (\.\(plantuml\|pum\|plu\)\' . plantuml-mode) (\.strace\' . strace-mode) (\.styl\' . stylus-mode) (\.ts$ . typescript-mode) (\.\(e?ya?\|ra\)ml\' . yaml-mode) (\.gpg\(~\|\.~[0-9]+~\)?\' nil epa-file) (\.elc\' . elisp-byte-code-mode) (\.dz\' nil jka-compr) (\.xz\' nil jka-compr) (\.lzma\' nil jka-compr) (\.lz\' nil jka-compr) (\.g?z\' nil jka-compr) (\.bz2\' nil jka-compr) (\.Z\' nil jka-compr) (\.vr[hi]?\' . vera-mode) (\(?:\.\(?:rbw?\|ru\|rake\|thor\|jbuilder\|rabl\|gemspec\|podspec\)\|/\(?:Gem\|Rake\|Cap\|Thor\|Puppet\|Berks\|Vagrant\|Guard\|Pod\)file\)\' . ruby-mode) (\.re?st\' . rst-mode) (\.pyw?\' . python-mode) (\.scss\' . scss-mode) (\.awk\' . awk-mode) (\.\(u?lpc\|pike\|pmod\(\.in\)?\)\' . pike-mode) (\.idl\' . idl-mode) (\.java\' . java-mode) (\.m\' . objc-mode) (\.ii\' . c++-mode) (\.i\' . c-mode) (\.lex\' . c-mode) (\.y\(acc\)?\' . c-mode) (\.[ch]\' . c-mode) (\.\(CC?\|HH?\)\' . c++-mode) (\.[ch]\(pp\|xx\|\+\+\)\' . c++-mode) (\.\(cc\|hh\)\' . c++-mode) (\.\(bat\|cmd\)\' . bat-mode) (\.[sx]?html?\(\.[a-zA-Z_]+\)?\' . html-mode) (\.svgz?\' . image-mode) (\.svgz?\' . xml-mode) (\.x[bp]m\' . image-mode) (\.x[bp]m\' . c-mode) (\.p[bpgn]m\' . image-mode) (\.tiff?\' . image-mode) (\.gif\' . image-mode) (\.png\' . image-mode) (\.jpe?g\' . image-mode) (\.te?xt\' . text-mode) (\.[tT]e[xX]\' . tex-mode) (\.ins\' . tex-mode) (\.ltx\' . latex-mode) (\.dtx\' . doctex-mode) (\.org\' . org-mode) (\.el\' . emacs-lisp-mode) (Project\.ede\' . emacs-lisp-mode) (\.\(scm\|stk\|ss\|sch\)\' . scheme-mode) (\.l\' . lisp-mode) (\.li?sp\' . lisp-mode) (\.[fF]\' . fortran-mode) (\.for\' . fortran-mode) (\.p\' . pascal-mode) (\.pas\' . pascal-mode) (\.\(dpr\|DPR\)\' . delphi-mode) (\.ad[abs]\' . ada-mode) (\.ad[bs].dg\' . ada-mode) (\.\([pP]\([Llm]\|erl\|od\)\|al\)\' . perl-mode) (Imakefile\' . makefile-imake-mode) (Makeppfile\(?:\.mk\)?\' . makefile-makepp-mode) (\.makepp\' . makefile-makepp-mode) (\.mk\' . makefile-gmake-mode) (\.make\' . makefile-gmake-mode) ([Mm]akefile\' . makefile-gmake-mode) (\.am\' . makefile-automake-mode) (\.texinfo\' . texinfo-mode) (\.te?xi\' . texinfo-mode) (\.[sS]\' . asm-mode) (\.asm\' . asm-mode) (\.css\' . css-mode) (\.mixal\' . mixal-mode) (\.gcov\' . compilation-mode) (/\.[a-z0-9-]*gdbinit . gdb-script-mode) (-gdb\.gdb . gdb-script-mode) ([cC]hange\.?[lL]og?\' . change-log-mode) ([cC]hange[lL]og[-.][0-9]+\' . change-log-mode) (\$CHANGE_LOG\$\.TXT . change-log-mode) (\.scm\.[0-9]*\' . scheme-mode) (\.[ckz]?sh\'\|\.shar\'\|/\.z?profile\' . sh-mode) (\.bash\' . sh-mode) (\(/\|\`\)\.\(bash_\(profile\|history\|log\(in\|out\)\)\|z?log\(in\|out\)\)\' . sh-mode) (\(/\|\`\)\.\(shrc\|[kz]shrc\|bashrc\|t?cshrc\|esrc\)\' . sh-mode) (\(/\|\`\)\.\([kz]shenv\|xinitrc\|startxrc\|xsession\)\' . sh-mode) (\.m?spec\' . sh-mode) (\.m[mes]\' . nroff-mode) (\.man\' . nroff-mode) (\.sty\' . latex-mode) (\.cl[so]\' . latex-mode) (\.bbl\' . latex-mode) (\.bib\' . bibtex-mode) (\.bst\' . bibtex-style-mode) (\.sql\' . sql-mode) (\.m[4c]\' . m4-mode) (\.mf\' . metafont-mode) (\.mp\' . metapost-mode) (\.vhdl?\' . vhdl-mode) (\.article\' . text-mode) (\.letter\' . text-mode) (\.i?tcl\' . tcl-mode) (\.exp\' . tcl-mode) (\.itk\' . tcl-mode) (\.icn\' . icon-mode) (\.sim\' . simula-mode) (\.mss\' . scribe-mode) (\.f9[05]\' . f90-mode) (\.f0[38]\' . f90-mode) (\.indent\.pro\' . fundamental-mode) (\.\(pro\|PRO\)\' . idlwave-mode) (\.srt\' . srecode-template-mode) (\.prolog\' . prolog-mode) (\.tar\' . tar-mode) (\.\(arc\|zip\|lzh\|lha\|zoo\|[jew]ar\|xpi\|rar\|7z\|ARC\|ZIP\|LZH\|LHA\|ZOO\|[JEW]AR\|XPI\|RAR\|7Z\)\' . archive-mode) (\.oxt\' . archive-mode) (\.\(deb\|[oi]pk\)\' . archive-mode) (\`/tmp/Re . text-mode) (/Message[0-9]*\' . text-mode) (\`/tmp/fol/ . text-mode) (\.oak\' . scheme-mode) (\.sgml?\' . sgml-mode) (\.x[ms]l\' . xml-mode) (\.dbk\' . xml-mode) (\.dtd\' . sgml-mode) (\.ds\(ss\)?l\' . dsssl-mode) (\.jsm?\' . javascript-mode) (\.json\' . javascript-mode) (\.[ds]?vh?\' . verilog-mode) (\.by\' . bovine-grammar-mode) (\.wy\' . wisent-grammar-mode) ([:/\]\..*\(emacs\|gnus\|viper\)\' . emacs-lisp-mode) (\`\..*emacs\' . emacs-lisp-mode) ([:/]_emacs\' . emacs-lisp-mode) (/crontab\.X*[0-9]+\' . shell-script-mode) (\.ml\' . lisp-mode) (\.ld[si]?\' . ld-script-mode) (ld\.?script\' . ld-script-mode) (\.xs\' . c-mode) (\.x[abdsru]?[cnw]?\' . ld-script-mode) (\.zone\' . dns-mode) (\.soa\' . dns-mode) (\.asd\' . lisp-mode) (\.\(asn\|mib\|smi\)\' . snmp-mode) (\.\(as\|mi\|sm\)2\' . snmpv2-mode) (\.\(diffs?\|patch\|rej\)\' . diff-mode) (\.\(dif\|pat\)\' . diff-mode) (\.[eE]?[pP][sS]\' . ps-mode) (\.\(?:PDF\|DVI\|OD[FGPST]\|DOCX?\|XLSX?\|PPTX?\|pdf\|djvu\|dvi\|od[fgpst]\|docx?\|xlsx?\|pptx?\)\' . doc-view-mode-maybe) (configure\.\(ac\|in\)\' . autoconf-mode) (\.s\(v\|iv\|ieve\)\' . sieve-mode) (BROWSE\' . ebrowse-tree-mode) (\.ebrowse\' . ebrowse-tree-mode) (#\*mail\* . mail-mode) (\.g\' . antlr-mode) (\.mod\' . m2-mode) (\.ses\' . ses-mode) (\.docbook\' . sgml-mode) (\.com\' . dcl-mode) (/config\.\(?:bat\|log\)\' . fundamental-mode) (\.\(?:[iI][nN][iI]\|[lL][sS][tT]\|[rR][eE][gG]\|[sS][yY][sS]\)\' . conf-mode) (\.\(?:desktop\|la\)\' . conf-unix-mode) (\.ppd\' . conf-ppd-mode) (java.+\.conf\' . conf-javaprop-mode) (\.properties\(?:\.[a-zA-Z0-9._-]+\)?\' . conf-javaprop-mode) (\`/etc/\(?:DIR_COLORS\|ethers\|.?fstab\|.*hosts\|lesskey\|login\.?de\(?:fs\|vperm\)\|magic\|mtab\|pam\.d/.*\|permissions\(?:\.d/.+\)?\|protocols\|rpc\|services\)\' . conf-space-mode) (\`/etc/\(?:acpid?/.+\|aliases\(?:\.d/.+\)?\|default/.+\|group-?\|hosts\..+\|inittab\|ksysguarddrc\|opera6rc\|passwd-?\|shadow-?\|sysconfig/.+\)\' . conf-mode) ([cC]hange[lL]og[-.][-0-9a-z]+\' . change-log-mode) (/\.?\(?:gitconfig\|gnokiirc\|hgrc\|kde.*rc\|mime\.types\|wgetrc\)\' . conf-mode) (/\.\(?:enigma\|gltron\|gtk\|hxplayer\|net\|neverball\|qt/.+\|realplayer\|scummvm\|sversion\|sylpheed/.+\|xmp\)rc\' . conf-mode) (/\.\(?:gdbtkinit\|grip\|orbital/.+txt\|rhosts\|tuxracer/options\)\' . conf-mode) (/\.?X\(?:default\|resource\|re\)s\> . conf-xdefaults-mode) (/X11.+app-defaults/\|\.ad\' . conf-xdefaults-mode) (/X11.+locale/.+/Compose\' . conf-colon-mode) (/X11.+locale/compose\.dir\' . conf-javaprop-mode) (\.~?[0-9]+\.[0-9][-.0-9]*~?\' nil t) (\.\(?:orig\|in\|[bB][aA][kK]\)\' nil t) ([/.]c\(?:on\)?f\(?:i?g\)?\(?:\.[a-zA-Z0-9._-]+\)?\' . conf-mode-maybe) (\.[1-9]\' . nroff-mode) (\.tgz\' . tar-mode) (\.tbz2?\' . tar-mode) (\.txz\' . tar-mode) (\.markdown\' . markdown-mode) (\.md\' . markdown-mode) (\.log\(?:\.[0-9]+\)?\' . logview-mode))

